nc: 1  
scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv,  [64, 3, 2]]                   
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]]            
  - [-1, 2, C3k2, [256, False, 0.25]]            
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]]            
  - [-1, 2, C2fSE, [512, False, 0.25]]           
  - [-1, 1, Conv,  [512, 3, 2]]                  
  - [-1, 4, C2fLESE, [512, True, 4]]           
  - [-1, 1, Conv,  [1024, 3, 2]]                 
  - [-1, 4, C2fLESE, [1024, True, 1]]           

head:
  - [-1, 1, DySample, [2, 'lp']]                
  - [[-1, 6], 1, Concat, [1]]                   
  - [-1, 1, GSSPA, []]                           
  - [-1, 2, C3k2, [512, False]]                  
  - [-1, 1, DySample, [2, 'lp']]                
  - [[-1, 4], 1, Concat, [1]]                    
  - [-1, 1, GSSPA, []]                          
  - [-1, 2, C3k2, [256, False]]                  
  - [-1, 1, Conv, [256, 3, 2]]                  
  - [[-1, 12], 1, Concat, [1]]                  
  - [-1, 1, GSSPA, []]                           
  - [-1, 2, C3k2, [512, False]]               
  - [-1, 1, Conv, [512, 3, 2]]                 
  - [[-1, 8], 1, Concat, [1]]                  
  - [-1, 1, GSSPA, []]                         
  - [-1, 2, C3k2, [1024, True]]                 
  - [16, 1, MiniSPP, []]                         
  - [20, 1, MiniSPP, []]                         
  - [24, 1, MiniSPP, []]                         
  - [[25, 26, 27], 1, MGDHead, [nc, progressive]]              